DataProcessors/ЗаполнениеВариантыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнениеВариантыОтчетов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/ВариантыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ВариантыОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КлючОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Администратор</Name>
					<Comment>Автор варианта отчета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЗначений</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВариантаОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВариантовОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Видимость</Name>
					<Comment>Вариант видим всем пользователям по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подсистемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подсистема</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Название</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предопределенная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкаВидимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗаполнениеВариантыОтчетов/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаписатьНаСервере()
	

	
	объектОбработка = РеквизитФормыВЗначение("Объект");
	
	макет = ОбъектОбработка.ПолучитьМакетЗаполнения();
	
	Для индекс = 2 по макет.ВысотаТаблицы Цикл
		
		наименование = Макет.Область(Индекс,1,Индекс,1).Текст;
		
		результатПоиска = Справочники.ВариантыОтчетов.НайтиПоНаименованию(наименование, Истина);
		
		Если Не результатПоиска.Пустая() Тогда
			вариантыОтчетовОбъект = результатПоиска.ПолучитьОбъект();
		Иначе
			вариантыОтчетовОбъект = Справочники.ВариантыОтчетов.СоздатьЭлемент();
		КонецЕсли;
		
		
		вариантыОтчетовОбъект.Наименование = Макет.Область(Индекс,1,Индекс,1).Текст;
 		вариантыОтчетовОбъект.ТипВариантаОтчета = Вычислить(Макет.Область(Индекс,2,Индекс,2).Текст);
		вариантыОтчетовОбъект.КлючВарианта = Макет.Область(Индекс,3,Индекс,3).Текст;
		вариантыОтчетовОбъект.КлючОбъекта = Макет.Область(Индекс,4,Индекс,4).Текст;
		
		вариантыОтчетовОбъект.Записать();
		
	КонецЦикла;
	
	
	//_ВариантОтчета.КлючВарианта = "Основной";
	//_ВариантОтчета.КлючОбъекта = "Отчет.ВзаиморасчетыСПокупателями";
	//_ВариантОтчета.Наименование = "Взаиморасчеты с покупателями (осн)";
	//_ВариантОтчета.ТипВариантаОтчета = Перечисления.ТипыВариантовОтчетов.Предопределенный;
	//
	//_ВариантОтчета.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры
